# Taps
tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "neovim/neovim"

# Brews
brew "ack"
brew "ansible"
brew "aspell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "composer"
brew "ctags"
brew "curl"
brew "deno"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "openjdk"
brew "grep"
brew "neovide"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "php"
brew "python"
brew "rainbarf"
brew "reattach-to-user-namespace"
brew "ruby"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "vagrant-completion"
brew "vim"
brew "vimpager"
brew "wezterm"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "heroku/brew/heroku"

# Cask options
cask_args appdir: "~/Applications"

# Casks
cask "1password6", args: { appdir: "/Applications" }
cask "appcleaner"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-mono"
cask "font-jetbrains-mono"
cask "insomnia"
cask "kitty"
cask "obsidian"
cask "pocket-casts"
cask "selfcontrol"
cask "signal"
cask "slack"
cask "spotify"
cask "syncthing"
cask "the-unarchiver"
cask "typora"
cask "vimr"
cask "visual-studio-code"
