tap "archivebox/archivebox"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "neovim/neovim"
tap "oven-sh/bun"

brew "ack"
brew "python@3.11"
brew "ansible"
brew "aspell"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "glib"
brew "libidn2"
brew "curl"
brew "freetds"
brew "krb5"
brew "libpq"
brew "php"
brew "composer"
brew "ctags"
brew "deno"
brew "direnv"
brew "entr"
brew "eza"
brew "gnutls"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "openjdk"
brew "gradle"
brew "grep"
brew "hadolint"
brew "httpd"
brew "hub"
brew "most"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "page"
brew "pandoc"
brew "php"
brew "podman"
brew "python"
brew "python@3.10"
brew "python@3.9"
brew "rainbarf"
brew "ripgrep"
brew "reattach-to-user-namespace"
brew "ruby"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "vimpager"
brew "wezterm"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "hashicorp/tap/terraform-ls"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"

cask "1password"
cask "activitywatch"
cask "android-studio"
cask "appcleaner"
cask "beekeeper-studio"
cask "dropbox"
cask "exifcleaner"
cask "fantastical"
cask "firefox-developer-edition"
cask "font-fira-mono"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "itsycal"
cask "keybase"
cask "kitty"
cask "musicbrainz-picard"
cask "ngrok"
cask "obsidian"
cask "onlyoffice"
cask "pocket-casts"
cask "podman-desktop"
cask "postman"
cask "rocket"
cask "selfcontrol"
cask "signal"
cask "slack"
cask "spotify"
cask "strawberry"
cask "syncthing"
cask "the-unarchiver"
cask "tomatobar"
cask "typora"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zettlr"

vscode "asvetliakov.vscode-neovim"
vscode "EditorConfig.EditorConfig"
vscode "gitduck.code-streaming"
vscode "hashicorp.terraform"
vscode "LinusU.auto-dark-mode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.Theme-3024Kit"
vscode "ms-vscode.Theme-TomorrowKit"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "Prisma.prisma"
vscode "rvest.vs-code-prettier-eslint"
vscode "svelte.svelte-vscode"
vscode "vespa-dev-works.jestRunIt"
vscode "vscodevim.vim"
